app/controllers/snapshot_controller.rb

  def view
    snapshot = Snapshot.all(:conditions => ["code = ?",params[:code]])
---
SELECT * FROM "snapshots" WHERE (code = 'jfk')